import re

#
# s = "Я ищу совпадения в 2024 году. И я их найду в 2 счета. 198765 Hello [-World]"
#
# reg = r"[a-zA-Z\]\[-]"
# print(re.findall(reg, s))
#
#
# st = "Час в 24-часовом формате от 00 до 23. 2021-06-15T21:45. Минуты в диапазоне от 00 до 59. 2021-06-15T01:09."
# req = r"[0-2][0-9]:[0-9][0-9]"
# print(re.findall(req, st))

# d = "Цифры: 7, +17, -42, 0013. 0.3"
# print(re.findall(r"[+-]?\d+[.\d]*", d))

# st = "05-03-1987 # Дата рождения"
# # print("Дата рождения", re.sub(r"#.*", "", st))
# print("Дата рождения", re.sub("-", ".", re.sub(r'#.*', '', st)))

st = author = "Пушкин А.С.; title = Евгений Онегин; price =200; year= 1831"

