# n = int(input("Введите количество ворон: "))
# if 0 <= n <= 9:
#     print("На ветке", n, end=" ")
#     if n == 1:
#         print("ворона")
#     elif 2 <= n <= 4:   #  elif n==2 or n==3 or n==4
#         print("вороны")
#     else:
#         print("ворон")
# else:
#     print("Ошибка ввода данных.")
# ____________________________________________________________________
# password = "user"
# match password:
#     case 'admin':
#         print("Администратор")
#     case "user":
#         print("Пользователь")
#     case _:
#         print("Логин не найден")
# ____________________________________________________________________

# day = 'среда'
# time = 17
#
# match day:
#     case "понедельник" | "вторник" | "среда" | "четверг" | "пятница" if 9<=time<=16:
#         print("Рабочий день")
#     case "суббота" | "воскресенье":
#         print("выходной день")
#     case _: print("Такого дня недели не существует, или не рабочее время")
# ________________________________________________________________________
# Тернарные выражения
# a, b = 10, 20
# print("a==b" if a == b else "a>b" if a > b else "b>a")
#
# ________________________________________________________________________
#
# Деление на ноль с использованием тернарного выражения
#
# a = int(input("Введите число A:"))
# b = int(input("Введите число B:"))
# print('На 0 делить нельзя' if b == 0 else a / b)
#  _______________________________________________________________________
#
#   try - попробовать, except - исключение
# try:
#     n = int(input("Введите целое число: "))
#     print(n * 2)
# except ValueError:
#     print("Что то пошло не так")
# print("Следующая строка")
#
# try:
#     n = int(input("Введите делимое:"))
#     m = int(input("Введите делитель:"))
#     print(n / m)
# except (ValueError, ZeroDivisionError):
#     print("Нельзя вводить строки или нельзя делить на ноль")
# else:  # когда в блоке try не возникло исключения
#     print("Все нормально. Вы ввели числа", n, "и", m)
# finally:  # Выполнится в любом случае
#     print("Конец программы")
# _________________________________________________________________________
#
#   Если есть хоть одна строка конкатенация, если 2 числа складывается.
#
#
# n = input("Введите первое число:")
# m = input("Введите второе число:")
# try:
#     n = int(n)
#     m = int(m)
# except ValueError:
#     n = str(n)
# finally:
#     print(n + m)
#
#
#  _____________________________________________________________________
#
# ЦЫКЛЫ:
# # While:
# i = 0
# while i < 5:
#     print("i =", i)
#     i += 1  # i = i + 1
#
#
#  Вывод
# i = 0
# while i <= 20:
#     if i % 2 == 0:
#         print(i)
#     i += 1

# n = int(input("Количество символов: "))
# # i = 0
# # while i < n:
# #     print("*", end="")
# #     i += 1
# print("*" * n)


a = int(input("Введите начало диапазона: "))
b = int(input("Введите конец диапазона: "))
res = 0
while a <= b:
    if a % 2:
        res += a
    a += 1
print(res)
